In [7]:
# Dataframe is a 2-d series object, with index and multiple columns of content.

import pandas as pd

record1 = pd.Series({"Name": "Alice", "Class": "Physics", "Score": 85})
record2 = pd.Series({"Name": "Jack", "Class": "Chemistry", "Score": 82})
record3 = pd.Series({"Name": "Helen", "Class": "Biology", "Score": 92})

In [8]:
# creating Dataframe using the above series

df = pd.DataFrame([record1, record2, record3], index=["School1", "School2", "School1"])
df.head() # renders a nice HTML table with the above values

          Name      Class  Score
School1  Alice    Physics     85
School2   Jack  Chemistry     82
School1  Helen    Biology     92

In [9]:
# creating dataframe using a list of dictionaries

students = [
    {"Name": "Alice", "Class": "Physics", "Score": 85}, 
    {"Name": "Jack", "Class": "Chemistry", "Score": 82}, 
    {"Name": "Helen", "Class": "Biology", "Score": 92}
]

df = pd.DataFrame(students, index=["School1", "School2", "School1"])
df.head()

          Name      Class  Score
School1  Alice    Physics     85
School2   Jack  Chemistry     82
School1  Helen    Biology     92

In [10]:
# using iloc and loc

df.loc["School2"]

Name          Jack
Class    Chemistry
Score           82
Name: School2, dtype: object

In [12]:
type(df.loc["School2"]) #pandas.core.series.Series

pandas.core.series.Series

In [11]:
df.loc["School1"]   # returns 2 rows

          Name    Class  Score
School1  Alice  Physics     85
School1  Helen  Biology     92

In [13]:
type(df.loc["School1"]) # pandas.core.frame.DataFrame

pandas.core.frame.DataFrame

In [14]:
# list only the names for values in School1

df.loc["School1", "Name"]   # returns name in School1 dataframe

School1    Alice
School1    Helen
Name: Name, dtype: object

In [15]:
df.T    # transposes rows and columns

       School1    School2  School1
Name     Alice       Jack    Helen
Class  Physics  Chemistry  Biology
Score       85         82       92

In [16]:
# check transposed dataframe values

df.T.loc["Name"]

School1    Alice
School2     Jack
School1    Helen
Name: Name, dtype: object

In [19]:
df["Name"]  # returns row for Name in transposed dataframe

School1    Alice
School2     Jack
School1    Helen
Name: Name, dtype: object

In [22]:
# chaining operations

df.loc['School1']['Name']

School1    Alice
School1    Helen
Name: Name, dtype: object

In [25]:
df.loc[:]   # just adding colon lists out everything

          Name      Class  Score
School1  Alice    Physics     85
School2   Jack  Chemistry     82
School1  Helen    Biology     92

In [24]:
# .loc parameter takes 2 parameters, row index and list of column names

df.loc[:,["Name", "Score"]]

          Name  Score
School1  Alice     85
School2   Jack     82
School1  Helen     92